from datetime import date

import requests


BASE_URL = 'https://robotax.io/api/v1/'


session = requests.session()


def main():
    with open('token.txt') as f:
        token = f.read()

    session.headers.update({'Authorization': f'Token {token}'})
    organizations = session.get(BASE_URL + 'organization/').json()['results']
    print(organizations[0])

    res = session.post(f'{BASE_URL}사업자/', json={
        '법인명_상호': '주식회사 테스트',
        '대표자주민등록번호': 'xxxx',
        '납세자ID': '8108100888', # 사업자번호 (개인은 주민등록번호)
        '홈택스ID': 'test', # 홈택스 계정. 전자신고파일을 업로드하는 계정과 일치해야 함
        '사업장소재지': '경기도 성남시 백현로 97',
        '사업장전화번호': '01012345678',
        '성명_대표자명': '홍길동',
        '개업일': '2017-12-22',
        '업종코드_list': ['722005']
    })
    print(res.status_code)
    사업자 = res.json()
    print(사업자['법인명_상호'])

    홍길동 = session.post(f'{BASE_URL}직원/', json={
        '소속': 사업자['id'],
        '성명': '홍길동',
        '주민등록번호': '8001011000000',
        '고용형태': '정규직',
        '기본급': 2_692_000,
        '입사일': '2015-07-25',
        '기본급여항목': {
            '식대': 100_000,
        },
    }).json()

    본인 = session.post(f'{BASE_URL}부양가족/', json={
        '직원': 홍길동['id'],
        '성명': '홍길동',
        '관계': '0',  # 직계비속(자녀･입양자)
        '주민등록번호': 홍길동['주민등록번호'],
        '한부모가족공제': '1'
    }).json()
    자녀 = session.post(f'{BASE_URL}부양가족/', json={
        '직원': 홍길동['id'],
        '성명': '홍수영',
        '관계': '4',  # 직계비속(자녀･입양자)
        '주민등록번호': '1301014200000',
        '자녀6세이하공제': '1'
    }).json()
    모 = session.post(f'{BASE_URL}부양가족/', json={
        '직원': 홍길동['id'],
        '성명': '김미숙',
        '관계': '1',  # 소득자의 직계존속
        '주민등록번호': '5801012000000',
    }).json()

    res = session.get(f'{BASE_URL}부양가족/', params={
        '직원': 홍길동['id']
    })
    for 부양가족 in res.json()['results']:
        print(부양가족)

    홍길동 = session.get(f'{BASE_URL}직원/{홍길동["id"]}/').json()
    print(홍길동['부양가족수'])
    # 자동으로 계산된 부양가족수를 원천세 계산 시에는 제외하기 위해 다시 1로 재설정
    홍길동 = session.patch(f'{BASE_URL}직원/{홍길동["id"]}/', json={
        '부양가족수': 1
    }).json()
    print(홍길동['부양가족수'])

    for month in range(1, 5):
        급여 = session.post(f"{BASE_URL}직원/{홍길동['id']}/급여입력/", json={
            '지급연월': date(2019, month, 1).strftime('%Y-%m-%d'),
        }).json()
        print(급여['지급일'], 급여['기본급'], 급여['소득세'])

    for month in range(5, 11):
        급여 = session.post(f"{BASE_URL}급여/", json={
            '직원': 홍길동['id'],
            '지급일': f'2019-{month:02}-25',
            '귀속연월': f'2019-{month:02}-01',
            '기본급': 2_592_000,
            '급여항목_set': [
                {'항목명세': '식대', '금액': 100_000},
                {'항목명세': '육아수당', '금액': 100_000},
            ]
        }).json()
        print(급여['지급일'], 급여['기본급'], 급여['소득세'])

    급여 = session.post(f"{BASE_URL}급여/", json={
        '직원': 홍길동['id'],
        '지급일': '2019-11-25',
        '귀속연월': '2019-11-01',
        '기본급': 2_442_000,
        '급여항목_set': [
            {'항목명세': '식대', '금액': 100_000},
            {'항목명세': '육아수당', '금액': 100_000},
        ]
    }).json()
    print(급여['지급일'], 급여['기본급'], 급여['소득세'])

    급여 = session.post(f"{BASE_URL}급여/", json={
        '직원': 홍길동['id'],
        '지급일': '2019-12-25',
        '귀속연월': '2019-12-01',
        '기본급': 2_492_000,
        '급여항목_set': [
            {'항목명세': '식대', '금액': 100_000},
            {'항목명세': '육아수당', '금액': 100_000},
        ]
    }).json()
    print(급여['지급일'], 급여['기본급'], 급여['소득세'])

    연말정산 = session.post(f'{BASE_URL}연말정산/', {
        '직원': 홍길동['id'],
        '귀속년도': 2019
    }).json()
    print('공제항목 입력 전', {k: v for k, v in 연말정산.items() if k in ['총지급액', '결정세액소득세', '기납부소득세', '차감징수소득세']})

    session.post(f'{BASE_URL}연말정산항목/', json=[
        {'연말정산': 연말정산['id'], '부양가족': 모['id'], '항목명': '의료비', '자료코드': '의료비', '사용처': None, '국세청자료': True, '금액': '277100'},
        {'연말정산': 연말정산['id'], '부양가족': 본인['id'], '항목명': '건강보험료', '자료코드': '건강보험료', '사용처': None, '국세청자료': True, '금액': '600280'},
        {'연말정산': 연말정산['id'], '부양가족': 모['id'], '항목명': '의료비', '자료코드': '의료비', '사용처': None, '국세청자료': True, '금액': '63300'},
        {'연말정산': 연말정산['id'], '부양가족': 본인['id'], '항목명': '국민연금보험료', '자료코드': '국민연금보험료', '사용처': None, '국세청자료': True, '금액': '830760'},
        {'연말정산': 연말정산['id'], '부양가족': 본인['id'], '항목명': '기부금', '자료코드': '기부금', '사용처': None, '국세청자료': True, '금액': '60000', 'data': {
            'sum': {'text': '60000'},
            'busnid': '2018206694',
            'dat_cd': 'G0020',
            'conb_sum': {'text': '60000'},
            'trade_nm': '사단법인 월드휴먼브리지',
            'donation_cd': '40',
            'sbdy_apln_sum': {'text': '0'}}
        },
        {'연말정산': 연말정산['id'], '부양가족': 모['id'], '항목명': '기부금', '자료코드': '기부금', '사용처': None, '국세청자료': True, '금액': '120000', 'data': {
            'sum': {'text': '120000'},
            'busnid': '1138206820',
            'dat_cd': 'G0020',
            'conb_sum': {'text': '120000'},
            'trade_nm': '사단법인 월드쉐어',
            'donation_cd': '40',
            'sbdy_apln_sum': {'text': '0'}}
        },
        {'연말정산': 연말정산['id'], '부양가족': 본인['id'], '항목명': '보장성_보험_장애인전용보장성보험', '자료코드': '보장성', '사용처': '주피보험자', '국세청자료': True, '금액': '180840'},
        {'연말정산': 연말정산['id'], '부양가족': 본인['id'], '항목명': '보장성_보험_장애인전용보장성보험', '자료코드': '보장성', '사용처': '주피보험자', '국세청자료': True, '금액': '549070'},
        {'연말정산': 연말정산['id'], '부양가족': 본인['id'], '항목명': '보장성_보험_장애인전용보장성보험', '자료코드': '보장성', '사용처': '주피보험자', '국세청자료': True, '금액': '414870'},
        {'연말정산': 연말정산['id'], '부양가족': 모['id'], '항목명': '보장성_보험_장애인전용보장성보험', '자료코드': '보장성', '사용처': None, '국세청자료': True, '금액': '2957500'},
        {'연말정산': 연말정산['id'], '부양가족': 모['id'], '항목명': '보장성_보험_장애인전용보장성보험', '자료코드': '보장성', '사용처': None, '국세청자료': True, '금액': '130800'},
        {'연말정산': 연말정산['id'], '부양가족': 모['id'], '항목명': '보장성_보험_장애인전용보장성보험', '자료코드': '보장성', '사용처': None, '국세청자료': True, '금액': '360000'},
        {'연말정산': 연말정산['id'], '부양가족': 모['id'], '항목명': '보장성_보험_장애인전용보장성보험', '자료코드': '보장성', '사용처': None, '국세청자료': True, '금액': '30340'},
        {'연말정산': 연말정산['id'], '부양가족': 모['id'], '항목명': '보장성_보험_장애인전용보장성보험', '자료코드': '보장성', '사용처': None, '국세청자료': True, '금액': '516100'},
        {'연말정산': 연말정산['id'], '부양가족': 모['id'], '항목명': '보장성_보험_장애인전용보장성보험', '자료코드': '보장성', '사용처': None, '국세청자료': True, '금액': '331500'},
        {'연말정산': 연말정산['id'], '부양가족': 모['id'], '항목명': '보장성_보험_장애인전용보장성보험', '자료코드': '보장성', '사용처': None, '국세청자료': True, '금액': '208400'},
        {'연말정산': 연말정산['id'], '부양가족': 모['id'], '항목명': '보장성_보험_장애인전용보장성보험', '자료코드': '보장성', '사용처': None, '국세청자료': True, '금액': '2218440'},
        {'연말정산': 연말정산['id'], '부양가족': 모['id'], '항목명': '보장성_보험_장애인전용보장성보험', '자료코드': '보장성', '사용처': None, '국세청자료': True, '금액': '460200'},
        {'연말정산': 연말정산['id'], '부양가족': 본인['id'], '항목명': '신용카드', '자료코드': '신용카드', '사용처': '전전년도_일반', '국세청자료': True, '금액': '40771052'},
        {'연말정산': 연말정산['id'], '부양가족': 본인['id'], '항목명': '신용카드', '자료코드': '신용카드', '사용처': '전전년도_전통시장사용분', '국세청자료': True, '금액': '32000'},
        {'연말정산': 연말정산['id'], '부양가족': 본인['id'], '항목명': '신용카드', '자료코드': '신용카드', '사용처': '전전년도_대중교통이용분', '국세청자료': True, '금액': '70145'},
        {'연말정산': 연말정산['id'], '부양가족': 본인['id'], '항목명': '신용카드', '자료코드': '신용카드', '사용처': '직전년도_일반', '국세청자료': True, '금액': '68858697'},
        {'연말정산': 연말정산['id'], '부양가족': 본인['id'], '항목명': '신용카드', '자료코드': '신용카드', '사용처': '직전년도_전통시장사용분', '국세청자료': True, '금액': '270680'},
        {'연말정산': 연말정산['id'], '부양가족': 본인['id'], '항목명': '신용카드', '자료코드': '신용카드', '사용처': '직전년도_대중교통이용분', '국세청자료': True, '금액': '507300'},
        {'연말정산': 연말정산['id'], '부양가족': 본인['id'], '항목명': '신용카드', '자료코드': '신용카드', '사용처': '일반', '국세청자료': True, '금액': '7150430'},
        {'연말정산': 연말정산['id'], '부양가족': 본인['id'], '항목명': '신용카드', '자료코드': '신용카드', '사용처': '전통시장사용분', '국세청자료': True, '금액': '285000'},
        {'연말정산': 연말정산['id'], '부양가족': 본인['id'], '항목명': '신용카드', '자료코드': '신용카드', '사용처': '대중교통이용분', '국세청자료': True, '금액': '42800'},
        {'연말정산': 연말정산['id'], '부양가족': 본인['id'], '항목명': '신용카드', '자료코드': '신용카드', '사용처': '일반', '국세청자료': True, '금액': '8566420'},
        {'연말정산': 연말정산['id'], '부양가족': 본인['id'], '항목명': '신용카드', '자료코드': '신용카드', '사용처': '전통시장사용분', '국세청자료': True, '금액': '0'},
        {'연말정산': 연말정산['id'], '부양가족': 본인['id'], '항목명': '신용카드', '자료코드': '신용카드', '사용처': '대중교통이용분', '국세청자료': True, '금액': '704150'},
        {'연말정산': 연말정산['id'], '부양가족': 본인['id'], '항목명': '신용카드', '자료코드': '신용카드', '사용처': '일반', '국세청자료': True, '금액': '41007937'},
        {'연말정산': 연말정산['id'], '부양가족': 본인['id'], '항목명': '신용카드', '자료코드': '신용카드', '사용처': '전통시장사용분', '국세청자료': True, '금액': '118800'},
        {'연말정산': 연말정산['id'], '부양가족': 본인['id'], '항목명': '신용카드', '자료코드': '신용카드', '사용처': '대중교통이용분', '국세청자료': True, '금액': '23800'},
        {'연말정산': 연말정산['id'], '부양가족': 본인['id'], '항목명': '신용카드', '자료코드': '신용카드', '사용처': '일반', '국세청자료': True, '금액': '113450'},
        {'연말정산': 연말정산['id'], '부양가족': 본인['id'], '항목명': '신용카드', '자료코드': '신용카드', '사용처': '일반', '국세청자료': True, '금액': '7901850'},
        {'연말정산': 연말정산['id'], '부양가족': 본인['id'], '항목명': '신용카드', '자료코드': '신용카드', '사용처': '전통시장사용분', '국세청자료': True, '금액': '101000'},
        {'연말정산': 연말정산['id'], '부양가족': 본인['id'], '항목명': '신용카드', '자료코드': '신용카드', '사용처': '대중교통이용분', '국세청자료': True, '금액': '487950'},
        {'연말정산': 연말정산['id'], '부양가족': 본인['id'], '항목명': '의료비', '자료코드': '의료비', '사용처': None, '국세청자료': True, '금액': '16000'},
        {'연말정산': 연말정산['id'], '부양가족': 본인['id'], '항목명': '의료비', '자료코드': '의료비', '사용처': None, '국세청자료': True, '금액': '21400'},
        {'연말정산': 연말정산['id'], '부양가족': 본인['id'], '항목명': '의료비', '자료코드': '의료비', '사용처': None, '국세청자료': True, '금액': '6920'},
        {'연말정산': 연말정산['id'], '부양가족': 본인['id'], '항목명': '의료비', '자료코드': '의료비', '사용처': None, '국세청자료': True, '금액': '57000'},
        {'연말정산': 연말정산['id'], '부양가족': 본인['id'], '항목명': '의료비', '자료코드': '의료비', '사용처': None, '국세청자료': True, '금액': '10000'},
        {'연말정산': 연말정산['id'], '부양가족': 본인['id'], '항목명': '의료비', '자료코드': '의료비', '사용처': None, '국세청자료': True, '금액': '17900'},
        {'연말정산': 연말정산['id'], '부양가족': 본인['id'], '항목명': '의료비', '자료코드': '의료비', '사용처': None, '국세청자료': True, '금액': '2660'},
        {'연말정산': 연말정산['id'], '부양가족': 본인['id'], '항목명': '의료비', '자료코드': '의료비', '사용처': None, '국세청자료': True, '금액': '4900'},
        {'연말정산': 연말정산['id'], '부양가족': 본인['id'], '항목명': '의료비', '자료코드': '의료비', '사용처': None, '국세청자료': True, '금액': '5900'},
        {'연말정산': 연말정산['id'], '부양가족': 본인['id'], '항목명': '의료비', '자료코드': '의료비', '사용처': None, '국세청자료': True, '금액': '28200'},
        {'연말정산': 연말정산['id'], '부양가족': 본인['id'], '항목명': '의료비', '자료코드': '의료비', '사용처': None, '국세청자료': True, '금액': '7900'},
        {'연말정산': 연말정산['id'], '부양가족': 본인['id'], '항목명': '의료비', '자료코드': '의료비', '사용처': None, '국세청자료': True, '금액': '395140'},
        {'연말정산': 연말정산['id'], '부양가족': 본인['id'], '항목명': '의료비', '자료코드': '의료비', '사용처': None, '국세청자료': True, '금액': '3400'},
        {'연말정산': 연말정산['id'], '부양가족': 본인['id'], '항목명': '의료비', '자료코드': '의료비', '사용처': None, '국세청자료': True, '금액': '9250'},
        {'연말정산': 연말정산['id'], '부양가족': 모['id'], '항목명': '의료비', '자료코드': '의료비', '사용처': None, '국세청자료': True, '금액': '751000'},
        {'연말정산': 연말정산['id'], '부양가족': 모['id'], '항목명': '의료비', '자료코드': '의료비', '사용처': None, '국세청자료': True, '금액': '17900'},
        {'연말정산': 연말정산['id'], '부양가족': 모['id'], '항목명': '의료비', '자료코드': '의료비', '사용처': None, '국세청자료': True, '금액': '5950000'},
        {'연말정산': 연말정산['id'], '부양가족': 모['id'], '항목명': '의료비', '자료코드': '의료비', '사용처': None, '국세청자료': True, '금액': '10600'},
        {'연말정산': 연말정산['id'], '부양가족': 모['id'], '항목명': '의료비', '자료코드': '의료비', '사용처': None, '국세청자료': True, '금액': '4600'},
        {'연말정산': 연말정산['id'], '부양가족': 모['id'], '항목명': '의료비', '자료코드': '의료비', '사용처': None, '국세청자료': True, '금액': '315700'},
        {'연말정산': 연말정산['id'], '부양가족': 모['id'], '항목명': '의료비', '자료코드': '의료비', '사용처': None, '국세청자료': True, '금액': '302200'},
        {'연말정산': 연말정산['id'], '부양가족': 모['id'], '항목명': '의료비', '자료코드': '의료비', '사용처': None, '국세청자료': True, '금액': '5000'},
        {'연말정산': 연말정산['id'], '부양가족': 자녀['id'], '항목명': '의료비', '자료코드': '의료비', '사용처': None, '국세청자료': True, '금액': '36500'},
        {'연말정산': 연말정산['id'], '부양가족': 자녀['id'], '항목명': '의료비', '자료코드': '의료비', '사용처': None, '국세청자료': True, '금액': '96700'},
        {'연말정산': 연말정산['id'], '부양가족': 자녀['id'], '항목명': '의료비', '자료코드': '의료비', '사용처': None, '국세청자료': True, '금액': '10600'},
        {'연말정산': 연말정산['id'], '부양가족': 자녀['id'], '항목명': '의료비', '자료코드': '의료비', '사용처': None, '국세청자료': True, '금액': '90640'},
        {'연말정산': 연말정산['id'], '부양가족': 자녀['id'], '항목명': '의료비', '자료코드': '의료비', '사용처': None, '국세청자료': True, '금액': '78400'},
        {'연말정산': 연말정산['id'], '부양가족': 자녀['id'], '항목명': '의료비', '자료코드': '의료비', '사용처': None, '국세청자료': True, '금액': '7800'},
        {'연말정산': 연말정산['id'], '부양가족': 자녀['id'], '항목명': '의료비', '자료코드': '의료비', '사용처': None, '국세청자료': True, '금액': '4200'},
        {'연말정산': 연말정산['id'], '부양가족': 자녀['id'], '항목명': '의료비', '자료코드': '의료비', '사용처': None, '국세청자료': True, '금액': '196000'},
        {'연말정산': 연말정산['id'], '부양가족': 자녀['id'], '항목명': '의료비', '자료코드': '의료비', '사용처': None, '국세청자료': True, '금액': '5700'},
        {'연말정산': 연말정산['id'], '부양가족': 자녀['id'], '항목명': '의료비', '자료코드': '의료비', '사용처': None, '국세청자료': True, '금액': '9800'},
        {'연말정산': 연말정산['id'], '부양가족': 자녀['id'], '항목명': '의료비', '자료코드': '의료비', '사용처': None, '국세청자료': True, '금액': '30000'},
        {'연말정산': 연말정산['id'], '부양가족': 자녀['id'], '항목명': '의료비', '자료코드': '의료비', '사용처': None, '국세청자료': True, '금액': '1400'},
        {'연말정산': 연말정산['id'], '부양가족': 자녀['id'], '항목명': '의료비', '자료코드': '의료비', '사용처': None, '국세청자료': True, '금액': '16850'},
        {'연말정산': 연말정산['id'], '부양가족': 본인['id'], '항목명': '현금영수증', '자료코드': '현금영수증', '사용처': '직전년도_대중교통이용분', '국세청자료': True, '금액': '0'},
        {'연말정산': 연말정산['id'], '부양가족': 본인['id'], '항목명': '직불카드등', '자료코드': '직불카드', '사용처': '전전년도_일반', '국세청자료': True, '금액': '5594986'},
        {'연말정산': 연말정산['id'], '부양가족': 본인['id'], '항목명': '직불카드등', '자료코드': '직불카드', '사용처': '전전년도_전통시장사용분', '국세청자료': True, '금액': '0'},
        {'연말정산': 연말정산['id'], '부양가족': 본인['id'], '항목명': '직불카드등', '자료코드': '직불카드', '사용처': '전전년도_대중교통이용분', '국세청자료': True, '금액': '0'},
        {'연말정산': 연말정산['id'], '부양가족': 본인['id'], '항목명': '직불카드등', '자료코드': '직불카드', '사용처': '직전년도_일반', '국세청자료': True, '금액': '2649233'},
        {'연말정산': 연말정산['id'], '부양가족': 본인['id'], '항목명': '직불카드등', '자료코드': '직불카드', '사용처': '직전년도_전통시장사용분', '국세청자료': True, '금액': '0'},
        {'연말정산': 연말정산['id'], '부양가족': 본인['id'], '항목명': '직불카드등', '자료코드': '직불카드', '사용처': '직전년도_대중교통이용분', '국세청자료': True, '금액': '0'},
        {'연말정산': 연말정산['id'], '부양가족': 본인['id'], '항목명': '직불카드등', '자료코드': '직불카드', '사용처': '일반', '국세청자료': True, '금액': '25050'},
        {'연말정산': 연말정산['id'], '부양가족': 모['id'], '항목명': '직불카드등', '자료코드': '직불카드', '사용처': '일반', '국세청자료': True, '금액': '2472770'},
        {'연말정산': 연말정산['id'], '부양가족': 모['id'], '항목명': '직불카드등', '자료코드': '직불카드', '사용처': '대중교통이용분', '국세청자료': True, '금액': '0'},
        {'연말정산': 연말정산['id'], '부양가족': 본인['id'], '항목명': '현금영수증', '자료코드': '현금영수증', '사용처': '전전년도_일반', '국세청자료': True, '금액': '9960'},
        {'연말정산': 연말정산['id'], '부양가족': 본인['id'], '항목명': '현금영수증', '자료코드': '현금영수증', '사용처': '전전년도_전통시장사용분', '국세청자료': True, '금액': '0'},
        {'연말정산': 연말정산['id'], '부양가족': 본인['id'], '항목명': '현금영수증', '자료코드': '현금영수증', '사용처': '전전년도_대중교통이용분', '국세청자료': True, '금액': '0'},
        {'연말정산': 연말정산['id'], '부양가족': 본인['id'], '항목명': '현금영수증', '자료코드': '현금영수증', '사용처': '직전년도_일반', '국세청자료': True, '금액': '350'},
        {'연말정산': 연말정산['id'], '부양가족': 본인['id'], '항목명': '현금영수증', '자료코드': '현금영수증', '사용처': '직전년도_전통시장사용분', '국세청자료': True, '금액': '0'},
        {'연말정산': 연말정산['id'], '부양가족': 본인['id'], '항목명': '현금영수증', '자료코드': '현금영수증', '사용처': '일반', '국세청자료': True, '금액': '4420'},
        {'연말정산': 연말정산['id'], '부양가족': 모['id'], '항목명': '현금영수증', '자료코드': '현금영수증', '사용처': '일반', '국세청자료': True, '금액': '77000'},
        {'연말정산': 연말정산['id'], '부양가족': 모['id'], '항목명': '의료비레코드', '자료코드': None, '사용처': None, '국세청자료': True, '금액': '7697400'},
        {'연말정산': 연말정산['id'], '부양가족': 본인['id'], '항목명': '의료비레코드', '자료코드': None, '사용처': None, '국세청자료': True, '금액': '586570'},
        {'연말정산': 연말정산['id'], '부양가족': 자녀['id'], '항목명': '의료비레코드', '자료코드': None, '사용처': None, '국세청자료': True, '금액': '584590'}
    ])

    연말정산 = session.post(f'{BASE_URL}연말정산/{연말정산["id"]}/loaddata/').json()
    print('공제항목 입력 후', {k: v for k, v in 연말정산.items() if k in ['총지급액', '결정세액소득세', '기납부소득세', '차감징수소득세']})

    # clean up test data
    session.delete(f'{BASE_URL}사업자/{사업자["id"]}/')


if __name__ == '__main__':
    main()

